#include <stdio.h>

int main()
{
    /* code */
    // 原码10000000000000000000000000010100 -> 反码11111111111111111111111111101011->补码11111111111111111111111111101100 
    int i = -20;
    // 补码00000000000000000000000000001010
    unsigned int j = 10;
    // i + j 11111111111111111111111111110110 -> 11111111111111111111111111110101 -> 10000000000000000000000000001010 -> -10
    printf("%d\n",i + j);
    // 一个 unsigned int和int计算会将int转换为unsigned int
    // i > 0 j > 0
    if (i + j > 0)
    {
        /* code */
        printf("大于0\n");
    }else{
        /* code */
        printf("小于0\n");
    }
    // 死循环
    unsigned int k;
    for (k = 0; k >= 0; k--)
    {
        /* code */
        printf("真好玩\n");
    }
    return 0;
    
}
